Revit 2027 API
DividedPath.IsValidSpacingRuleJustification Method
 Checks that the justification enumeration value is valid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidSpacingRuleJustification(
	SpacingRuleJustification justification
)
Public Function IsValidSpacingRuleJustification (
	justification As SpacingRuleJustification
) As Boolean
public:
bool IsValidSpacingRuleJustification(
	SpacingRuleJustification justification
)
member IsValidSpacingRuleJustification :
        justification : SpacingRuleJustification -> bool
Parameters
justification SpacingRuleJustification
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace